In [1]:
import pandas as pd

In [4]:
data=[["Roshan",34],["Hardik",25],["Nikhil",45],["Vishalsumaro",95],["anshuvishwakarma",98],["Ajeet",45],["Raghuvendradutt",49]]

In [5]:
data

[['Roshan', 34],
 ['Hardik', 25],
 ['Nikhil', 45],
 ['Vishalsumaro', 95],
 ['anshuvishwakarma', 98],
 ['Ajeet', 45],
 ['Raghuvendradutt', 49]]

In [9]:
pd.DataFrame(data,columns=["Name","Marks"])

               Name  Marks
0            Roshan     34
1            Hardik     25
2            Nikhil     45
3      Vishalsumaro     95
4  anshuvishwakarma     98
5             Ajeet     45
6   Raghuvendradutt     49

In [10]:
#use discinary for dataframe make 
data={"a": [4,5,6],"b":[7,8,9]}

In [11]:
df=pd.DataFrame(data)

In [12]:
df

   a  b
0  4  7
1  5  8
2  6  9

In [13]:
import numpy as np

In [15]:
arr=np.array([[1,2],[5,6]])

In [16]:
df=pd.DataFrame(arr,columns=["A","B"])

In [17]:
df

   A  B
0  1  2
1  5  6

In [20]:
df=pd.read_excel("data.xlsx")

In [21]:
df

      Name School  Marks
0   Roshan    SPS     85
1   Hardik    GPS     69
2    Anshu    VNS     45
3    Raghu    GNS     49
4   Vishal    JPS     78
5  Jasmine    SSB     82
6  Shubham    RPS     89

In [24]:
df=pd.read_csv("data.csv")

In [25]:
df

      Name School  Marks
0   Roshan    SPS     85
1   Hardik    GPS     69
2    Anshu    VNS     45
3    Raghu    GNS     49
4   Vishal    JPS     78
5  Jasmine    SSB     82
6  Shubham    RPS     89

In [26]:
df=pd.read_json("data.json")

In [27]:
df

     Name    language
0   Harry      python
1  Hardik  Javascript

In [32]:
url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv"
df = pd.read_csv(url)

In [33]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [34]:
#EDA

In [35]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [36]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [38]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [39]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [40]:
df.shape

(244, 7)